I've been encountering a similar issue with the `azuredevops_project` data source that seems to be related to this and/or suffer from the same root issue.

I've been using the data source in child modules following this pattern:

- passing in the project name from the parent module
- creating a data source reference with the project name
- consuming the output project `id` property in the child module resources

It seems that any change to the parent project (changing the description, etc.) forces replacement on any child resource that consumes the `id` property from the `azuredevops_project` data source.  In some cases it says the `id` will be `(known after apply)`, in other cases it gives a similar message if the `id` is used in a scope attribute.

In the following sample, I'm creating two groups.  One references the `id` from the project resource, the other references the `id` from the project data source (which references the `name` from the project resource):

```
resource "azuredevops_project" "project" {
  name               = "Test Project"
  description        = "Test Project Description"
  visibility         = "private"
  version_control    = "Git"
  work_item_template = "Agile"

  features = {
    "testplans" = "disabled"
    "artifacts" = "disabled"
  }
}

resource "azuredevops_group" "group_resource_reference" {
  scope        = azuredevops_project.project.id
  display_name = "Test group resource"
  description  = "Test description resource"
}

data "azuredevops_project" "project" {
  name = azuredevops_project.project.name
}

resource "azuredevops_group" "group_data_reference" {
  scope        = data.azuredevops_project.project.id
  display_name = "Test group data"
  description  = "Test description data"
}

```

If I create this, and then change the project's description value and re-run, I get this plan:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azuredevops_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "azuredevops_project" "project"  {
      ~ description         = "Test Project Description" -> (known after apply)
      ~ features            = {} -> (known after apply)
      ~ id                  = "7214ca6b-906c-4674-8593-b98b19125c58" -> (known after apply)
        name                = "Test Project"
      ~ process_template_id = "adcc42ab-9882-485e-a3ed-7678f01f66bc" -> (known after apply)
      - project_id          = "7214ca6b-906c-4674-8593-b98b19125c58" -> null
      ~ version_control     = "Git" -> (known after apply)
      ~ visibility          = "private" -> (known after apply)
      ~ work_item_template  = "Agile" -> (known after apply)
    }

  # azuredevops_group.group_data_reference must be replaced
-/+ resource "azuredevops_group" "group_data_reference" {
      ~ descriptor     = "vssgp.Uy0xLTktMTU1MTM3NDI0NS03NzExNjE4Ni05MDI4NDEwNy0yMjkzNDcxODY0LTE2OTk4MDc5MDItMS00MTA5ODEwNjU3LTIwNjM5MjMyNzUtMzE1Njg3MDg4OS00MDc3NjM1MjEx" -> (known after apply)
      ~ domain         = "vstfs:///Classification/TeamProject/7214ca6b-906c-4674-8593-b98b19125c58" -> (known after apply)
      ~ id             = "vssgp.Uy0xLTktMTU1MTM3NDI0NS03NzExNjE4Ni05MDI4NDEwNy0yMjkzNDcxODY0LTE2OTk4MDc5MDItMS00MTA5ODEwNjU3LTIwNjM5MjMyNzUtMzE1Njg3MDg4OS00MDc3NjM1MjEx" -> (known after apply)
      + mail           = (known after apply)
      ~ members        = [] -> (known after apply)
      ~ origin         = "vsts" -> (known after apply)
      ~ origin_id      = "e308567b-388b-4323-95e4-29f91c26248d" -> (known after apply)
      ~ principal_name = "[Test Project]\\Test group data" -> (known after apply)
      ~ scope          = "7214ca6b-906c-4674-8593-b98b19125c58" -> (known after apply) # forces replacement
      ~ subject_kind   = "group" -> (known after apply)
      ~ url            = "https://vssps.dev.azure.com/kc-digitalmarketing/_apis/Graph/Groups/vssgp.Uy0xLTktMTU1MTM3NDI0NS03NzExNjE4Ni05MDI4NDEwNy0yMjkzNDcxODY0LTE2OTk4MDc5MDItMS00MTA5ODEwNjU3LTIwNjM5MjMyNzUtMzE1Njg3MDg4OS00MDc3NjM1MjEx" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azuredevops_project.project will be updated in-place
  ~ resource "azuredevops_project" "project" {
      ~ description         = "Test Project Description" -> "Test Project Description - NEW VALUE"
        id                  = "7214ca6b-906c-4674-8593-b98b19125c58"
        name                = "Test Project"
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

Changes to a resource shouldn't (and don't) generate a new `id` property, but in this case, that seems to be how the change is being interpreted by dependent resources.